## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/14464778863)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * google_artifact_registry_repository.dockerhub_mirror



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.dockerhub_mirror must be replaced
-/+ resource "google_artifact_registry_repository" "dockerhub_mirror" {
      ~ create_time            = "2024-10-31T09:26:30.153692Z" -> (known after apply)
      ~ id                     = "projects/sap-kyma-prow/locations/europe/repositories/dockerhub-mirror" -> (known after apply)
      - labels                 = {} -> null
      ~ name                   = "dockerhub-mirror" -> (known after apply)
      ~ update_time            = "2024-10-31T09:26:30.153692Z" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ remote_repository_config {
          - disable_upstream_validation = false -> null
            # (1 unchanged attribute hidden)

          + upstream_credentials { # forces replacement
              + username_password_credentials { # forces replacement
                  + password_secret_version = "projects/kyma-project/secrets/dockerhub-oat-new/versions/latest" # forces replacement
                  + username                = "sapcom" # forces replacement
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ artifact_registry                              = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2025-04-11T19:39:51.116463Z" -> "2025-04-15T06:36:00.392140Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry has changed
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
      ~ update_time            = "2025-04-11T19:39:51.116463Z" -> "2025-04-15T06:36:00.392140Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":12929,"Program":"tfcmt","SHA1":"9d64205fc47c1c98494f6d1d62148cecba814e02","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->